Revit 2027 API
ReferenceArrayArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	ReferenceArray item
)
Public Overridable Sub Append (
	item As ReferenceArray
)
public:
virtual void Append(
	ReferenceArray^ item
)
abstract Append :
        item : ReferenceArray -> unit
override Append :
        item : ReferenceArray -> unit
Parameters
item ReferenceArray
See Also
Reference
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace